
# Formal Elements

1. **שחקנים**
  קהל יעד: המשחק מיועד לגילאים 65+ שנים. מתאים במיוחד לאוכלוסייה עם ירידה קוגניטיבית עם בעיות בזמן תגובה , אך גם לצעירים שמעוניינים בתרגוול זמן התגובה.
מספר שחקנים: שחקן יחיד.
אינטראקציה: אינטראקציה עם דמויות במשחק, ללא תחרות עם שחקנים אחרים.

2. **יעדים**
מטרה מרכזית:  לאסוף מוצרים כמה שיותר מהר
יעדים נוספים:
לשפר ולתרגל את יכולת זמןהתגובה .
לעודד התקדמות הדרגתית בשלבי המשחק תוך חוויה מהנה.

3. **תהליכים**
   - תהליכי-ההתחלה: השחקן צריך להתחיל מהמסך הראשי ולבחור רמת קושי.
   - לולאת הליבה: השחקן אסף מוצרים תוך כדי הימנעות ממכשולים ומספיק להגיע ליעדים.
   - תהליכי-הסיום: השחקן יכול לסיים את המשחק אם הוא הגיע ל-30 נקודות או אם עברו שתי דקות.

4. **חוקים**
   השחקן צריך להגיע לנתיב המוצר וללחוץ על רווח כדי לעצור. אם הוא לוחץ רווח בנתיב הלא נכון, יש צליל שגיאה. לכל משחק יש מקס זמן של 2 דק או להגיע ל 30 נק.

5. **משאבים**
השחקן מרוויח נקודה על כל מוצר שאוסף -

6. **עימותים**
   אין עימותים ישירים עם שחקנים אחרים, השחקן צריך להימנע ממכשולים ולספיק להפסיק בעיתוי הנכון.

7. **גבולות**
   העולם סגור, בצדדים יש קירות של הסופר, כך שהגבולות ברורים. אם השחקן מנסה לצאת מגבולות, לא קורה שום דבר והשחקן נשאר בתוך המרחב.

8. **תוצאות**
   המשחק לא כולל ניצחון או הפסד ישיר. יש אפשרות לסיים את המשחק אם השחקן מגיע ל-30 נקודות או אם עברו שתי דקות. המשחק מציג את התוצאה בסיום עם פירוט על זמן התגובה של השחקן.
